care-ris/src/HYS_InterfaceManager/SRC/DicomAdapter/Common.Soap/DefaultConfiguration/CSH.SOAPRequestTemplate.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header></soap:Header>
  <soap:Body>
    <MessageCom xmlns="http://www.HaoYiShenghealth.com/">
      <RequestMessage>{0}</RequestMessage>
    </MessageCom>
  </soap:Body>
</soap:Envelope>